lkolbly/cmsis-svd/data/TexasInstruments/LM3S3Z26.svd
        <register>
          <name>DIS0</name>
          <description>Interrupt 0-31 Clear Enable</description>
          <addressOffset>0x00000180</addressOffset>
          <fields>
            <field>
              <name>NVIC_DIS0_INT</name>
              <description>Interrupt Disable</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT0</name>
                  <description>Interrupt 0 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT1</name>
                  <description>Interrupt 1 disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT2</name>
                  <description>Interrupt 2 disable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT3</name>
                  <description>Interrupt 3 disable</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT4</name>
                  <description>Interrupt 4 disable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT5</name>
                  <description>Interrupt 5 disable</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT6</name>
                  <description>Interrupt 6 disable</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT7</name>
                  <description>Interrupt 7 disable</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT8</name>
                  <description>Interrupt 8 disable</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT9</name>
                  <description>Interrupt 9 disable</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT10</name>
                  <description>Interrupt 10 disable</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT11</name>
                  <description>Interrupt 11 disable</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT12</name>
                  <description>Interrupt 12 disable</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT13</name>
                  <description>Interrupt 13 disable</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT14</name>
                  <description>Interrupt 14 disable</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT15</name>
                  <description>Interrupt 15 disable</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT16</name>
                  <description>Interrupt 16 disable</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT17</name>
                  <description>Interrupt 17 disable</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT18</name>
                  <description>Interrupt 18 disable</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT19</name>
                  <description>Interrupt 19 disable</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT20</name>
                  <description>Interrupt 20 disable</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT21</name>
                  <description>Interrupt 21 disable</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT22</name>
                  <description>Interrupt 22 disable</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT23</name>
                  <description>Interrupt 23 disable</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT24</name>
                  <description>Interrupt 24 disable</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT25</name>
                  <description>Interrupt 25 disable</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT26</name>
                  <description>Interrupt 26 disable</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT27</name>
                  <description>Interrupt 27 disable</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT28</name>
                  <description>Interrupt 28 disable</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT29</name>
                  <description>Interrupt 29 disable</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT30</name>
                  <description>Interrupt 30 disable</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS0_INT31</name>
                  <description>Interrupt 31 disable</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS1</name>
          <description>Interrupt 32-54 Clear Enable</description>
          <addressOffset>0x00000184</addressOffset>
          <fields>
            <field>
              <name>NVIC_DIS1_INT</name>
              <description>Interrupt Disable</description>
              <bitRange>[22:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT32</name>
                  <description>Interrupt 32 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT33</name>
                  <description>Interrupt 33 disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT34</name>
                  <description>Interrupt 34 disable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT35</name>
                  <description>Interrupt 35 disable</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT36</name>
                  <description>Interrupt 36 disable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT37</name>
                  <description>Interrupt 37 disable</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT38</name>
                  <description>Interrupt 38 disable</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT39</name>
                  <description>Interrupt 39 disable</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT40</name>
                  <description>Interrupt 40 disable</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT41</name>
                  <description>Interrupt 41 disable</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT42</name>
                  <description>Interrupt 42 disable</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT43</name>
                  <description>Interrupt 43 disable</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT44</name>
                  <description>Interrupt 44 disable</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT45</name>
                  <description>Interrupt 45 disable</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT46</name>
                  <description>Interrupt 46 disable</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT47</name>
                  <description>Interrupt 47 disable</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT48</name>
                  <description>Interrupt 48 disable</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT49</name>
                  <description>Interrupt 49 disable</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT50</name>
                  <description>Interrupt 50 disable</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT51</name>
                  <description>Interrupt 51 disable</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT52</name>
                  <description>Interrupt 52 disable</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT53</name>
                  <description>Interrupt 53 disable</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DIS1_INT54</name>
                  <description>Interrupt 54 disable</description>
                  <value>0x400000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PEND0</name>
          <description>Interrupt 0-31 Set Pending</description>
          <addressOffset>0x00000200</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND0_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT0</name>
                  <description>Interrupt 0 pend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT1</name>
                  <description>Interrupt 1 pend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT2</name>
                  <description>Interrupt 2 pend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT3</name>
                  <description>Interrupt 3 pend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT4</name>
                  <description>Interrupt 4 pend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT5</name>
                  <description>Interrupt 5 pend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT6</name>
                  <description>Interrupt 6 pend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT7</name>
                  <description>Interrupt 7 pend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT8</name>
                  <description>Interrupt 8 pend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT9</name>
                  <description>Interrupt 9 pend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT10</name>
                  <description>Interrupt 10 pend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT11</name>
                  <description>Interrupt 11 pend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT12</name>
                  <description>Interrupt 12 pend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT13</name>
                  <description>Interrupt 13 pend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT14</name>
                  <description>Interrupt 14 pend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT15</name>
                  <description>Interrupt 15 pend</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT16</name>
                  <description>Interrupt 16 pend</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT17</name>
                  <description>Interrupt 17 pend</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT18</name>
                  <description>Interrupt 18 pend</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT19</name>
                  <description>Interrupt 19 pend</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT20</name>
                  <description>Interrupt 20 pend</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT21</name>
                  <description>Interrupt 21 pend</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT22</name>
                  <description>Interrupt 22 pend</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT23</name>
                  <description>Interrupt 23 pend</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT24</name>
                  <description>Interrupt 24 pend</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT25</name>
                  <description>Interrupt 25 pend</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT26</name>
                  <description>Interrupt 26 pend</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT27</name>
                  <description>Interrupt 27 pend</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT28</name>
                  <description>Interrupt 28 pend</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT29</name>
                  <description>Interrupt 29 pend</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT30</name>
                  <description>Interrupt 30 pend</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT31</name>
                  <description>Interrupt 31 pend</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
